## Plan Result (prod-enterprise)




<pre><code>Plan: 81 to add, 36 to change, 0 to destroy.</code></pre>

* Create
  * module.environment[&#34;demo&#34;].azuread_application_password.token
  * module.environment[&#34;demo&#34;].azuread_group_member.acr
  * module.environment[&#34;demo&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;demo&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;demo&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;demo&#34;].azurerm_resource_group.rg
  * module.environment[&#34;demo&#34;].azurerm_service_plan.asp
  * module.environment[&#34;demo&#34;].random_uuid.app_uuid
  * module.environment[&#34;demo&#34;].time_rotating.one_year
  * module.environment[&#34;dev&#34;].azuread_application_password.token
  * module.environment[&#34;dev&#34;].azuread_group_member.acr
  * module.environment[&#34;dev&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;dev&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;dev&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;dev&#34;].azurerm_resource_group.rg
  * module.environment[&#34;dev&#34;].azurerm_service_plan.asp
  * module.environment[&#34;dev&#34;].random_uuid.app_uuid
  * module.environment[&#34;dev&#34;].time_rotating.one_year
  * module.environment[&#34;ithc&#34;].azuread_application_password.token
  * module.environment[&#34;ithc&#34;].azuread_group_member.acr
  * module.environment[&#34;ithc&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ithc&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;ithc&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ithc&#34;].azurerm_service_plan.asp
  * module.environment[&#34;ithc&#34;].random_uuid.app_uuid
  * module.environment[&#34;ithc&#34;].time_rotating.one_year
  * module.environment[&#34;prod&#34;].azuread_application_password.token
  * module.environment[&#34;prod&#34;].azuread_group_member.acr
  * module.environment[&#34;prod&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;prod&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;prod&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;prod&#34;].azurerm_resource_group.rg
  * module.environment[&#34;prod&#34;].azurerm_service_plan.asp
  * module.environment[&#34;prod&#34;].random_uuid.app_uuid
  * module.environment[&#34;prod&#34;].time_rotating.one_year
  * module.environment[&#34;ptl&#34;].azuread_application_password.token
  * module.environment[&#34;ptl&#34;].azuread_group_member.acr
  * module.environment[&#34;ptl&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptl&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptl&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptl&#34;].azurerm_service_plan.asp
  * module.environment[&#34;ptl&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptl&#34;].time_rotating.one_year
  * module.environment[&#34;ptlsbox&#34;].azuread_application_password.token
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.acr
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptlsbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;ptlsbox&#34;].azurerm_service_plan.asp
  * module.environment[&#34;ptlsbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;ptlsbox&#34;].time_rotating.one_year
  * module.environment[&#34;sbox&#34;].azuread_application_password.token
  * module.environment[&#34;sbox&#34;].azuread_group_member.acr
  * module.environment[&#34;sbox&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;sbox&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;sbox&#34;].azurerm_resource_group.rg
  * module.environment[&#34;sbox&#34;].azurerm_service_plan.asp
  * module.environment[&#34;sbox&#34;].random_uuid.app_uuid
  * module.environment[&#34;sbox&#34;].time_rotating.one_year
  * module.environment[&#34;stg&#34;].azuread_application_password.token
  * module.environment[&#34;stg&#34;].azuread_group_member.acr
  * module.environment[&#34;stg&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;stg&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;stg&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;stg&#34;].azurerm_resource_group.rg
  * module.environment[&#34;stg&#34;].azurerm_service_plan.asp
  * module.environment[&#34;stg&#34;].random_uuid.app_uuid
  * module.environment[&#34;stg&#34;].time_rotating.one_year
  * module.environment[&#34;test&#34;].azuread_application_password.token
  * module.environment[&#34;test&#34;].azuread_group_member.acr
  * module.environment[&#34;test&#34;].azuread_group_member.dns_zone_contributor
  * module.environment[&#34;test&#34;].azuread_group_member.members[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;test&#34;].azuread_group_member.members[&#34;DTS Operations&#34;]
  * module.environment[&#34;test&#34;].azurerm_resource_group.rg
  * module.environment[&#34;test&#34;].azurerm_service_plan.asp
  * module.environment[&#34;test&#34;].random_uuid.app_uuid
  * module.environment[&#34;test&#34;].time_rotating.one_year
* Update
  * module.environment[&#34;demo&#34;].azuread_application.app
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;demo&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;demo&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;dev&#34;].azuread_application.app
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;dev&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ithc&#34;].azuread_application.app
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ithc&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ithc&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;prod&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;prod&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptl&#34;].azuread_application.app
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptl&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptl&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;ptlsbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;sbox&#34;].azuread_application.app
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;sbox&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;sbox&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;stg&#34;].azuread_application.app
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;stg&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;stg&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]
  * module.environment[&#34;test&#34;].azuread_application.app
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DNS Zone Contributor&#34;]
  * module.environment[&#34;test&#34;].azuread_group.groups[&#34;DTS Operations&#34;]
  * module.environment[&#34;test&#34;].azuredevops_serviceendpoint_azurerm.endpoint[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.environment["demo"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "fcc63c4d-d347-4e4f-b32e-81643079b27d"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "b3209c28-68a2-9d27-205e-d8ccad753270"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Operations (env:demo) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Operations (env:demo)" -> null
              - enabled                    = true -> null
              - id                         = "b3209c28-68a2-9d27-205e-d8ccad753270" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Operations (env:demo) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Operations (env:demo)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:demo) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:demo)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:demo) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:demo)"
              + value                      = "user_impersonation"
            }
        }

      ~ web {
          ~ homepage_url  = "https://dev.azure.com/hmcts/Operations" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.environment["demo"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "fcc63c4d-d347-4e4f-b32e-81643079b27d"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["demo"].azuread_group.groups["DNS Zone Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DEMO DNS Zone Contributer Group" -> "Grants dns zone contributor permissions to the demo environment"
        id                         = "893dc142-adad-4200-b1d0-30b257f7d7b4"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["demo"].azuread_group.groups["DTS Operations"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DEMO Operations elevated access" -> "demo Operations elevated access"
        id                         = "9e6dd823-0630-41d4-9a58-67cd7d141452"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["demo"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "9e6dd823-0630-41d4-9a58-67cd7d141452"
    }

  # module.environment["demo"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = "893dc142-adad-4200-b1d0-30b257f7d7b4"
      + id               = (known after apply)
      + member_object_id = "9e6dd823-0630-41d4-9a58-67cd7d141452"
    }

  # module.environment["demo"].azuread_group_member.members["DNS Zone Contributor"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "893dc142-adad-4200-b1d0-30b257f7d7b4"
      + id               = (known after apply)
      + member_object_id = "b9f44ba5-3da9-4852-bc71-2763216099ff"
    }

  # module.environment["demo"].azuread_group_member.members["DTS Operations"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "9e6dd823-0630-41d4-9a58-67cd7d141452"
      + id               = (known after apply)
      + member_object_id = "b9f44ba5-3da9-4852-bc71-2763216099ff"
    }

  # module.environment["demo"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "164de47e-bace-4a22-8aff-fd79c4f26a01"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "e0edd805-2d7f-4535-b0af-f561e66d63ea"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.environment["demo"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-demo-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
    }

  # module.environment["demo"].azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "enterprise-demo-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "enterprise-demo-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "demo"
        }
      + worker_count                 = (known after apply)
    }

  # module.environment["demo"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["demo"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["dev"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "5f463690-f80e-4284-bb35-0b7c2cd014c3"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "9e904c6f-2000-ee6c-a227-8aa5f433c856"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Operations (env:dev) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Operations (env:dev)" -> null
              - enabled                    = true -> null
              - id                         = "9e904c6f-2000-ee6c-a227-8aa5f433c856" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Operations (env:dev) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Operations (env:dev)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:dev) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:dev)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:dev) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:dev)"
              + value                      = "user_impersonation"
            }
        }

      ~ web {
          ~ homepage_url  = "https://dev.azure.com/hmcts/Operations" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.environment["dev"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "5f463690-f80e-4284-bb35-0b7c2cd014c3"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["dev"].azuread_group.groups["DNS Zone Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DEV DNS Zone Contributer Group" -> "Grants dns zone contributor permissions to the dev environment"
        id                         = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["dev"].azuread_group.groups["DTS Operations"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DEV Operations elevated access" -> "dev Operations elevated access"
        id                         = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["dev"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.environment["dev"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.environment["dev"].azuread_group_member.members["DNS Zone Contributor"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "4fbd49ac-0f41-4712-b4ac-780af587f33b"
      + id               = (known after apply)
      + member_object_id = "91964082-2d21-44e5-b279-245b7bfb0c18"
    }

  # module.environment["dev"].azuread_group_member.members["DTS Operations"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
      + id               = (known after apply)
      + member_object_id = "91964082-2d21-44e5-b279-245b7bfb0c18"
    }

  # module.environment["dev"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "39355da5-655e-4d9e-8191-d5598b5c7de9"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "c3cba95b-f527-49c4-99ba-f5848722b3b6"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.environment["dev"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-dev-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
    }

  # module.environment["dev"].azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "enterprise-dev-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "enterprise-dev-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + worker_count                 = (known after apply)
    }

  # module.environment["dev"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["dev"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["ithc"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "cae18304-2c43-46af-86e8-926702c344b4"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "25c57000-6bec-e683-c130-7446f69308d5"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Operations (env:ithc) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Operations (env:ithc)" -> null
              - enabled                    = true -> null
              - id                         = "25c57000-6bec-e683-c130-7446f69308d5" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Operations (env:ithc) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Operations (env:ithc)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:ithc) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:ithc)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:ithc) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:ithc)"
              + value                      = "user_impersonation"
            }
        }

      ~ web {
          ~ homepage_url  = "https://dev.azure.com/hmcts/Operations" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.environment["ithc"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "cae18304-2c43-46af-86e8-926702c344b4"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["ithc"].azuread_group.groups["DNS Zone Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "ITHC DNS Zone Contributer Group" -> "Grants dns zone contributor permissions to the ithc environment"
        id                         = "457aabff-86ec-49cc-9b77-6b7b59420356"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["ithc"].azuread_group.groups["DTS Operations"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "ITHC Operations elevated access" -> "ithc Operations elevated access"
        id                         = "e564e3d3-ade1-457a-86bc-72cd74ec0fc8"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["ithc"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "e564e3d3-ade1-457a-86bc-72cd74ec0fc8"
    }

  # module.environment["ithc"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_objec

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

    = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["sbox"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.environment["sbox"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = "6c2d130e-ba66-408a-bdf9-f426a9730923"
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.environment["sbox"].azuread_group_member.members["DNS Zone Contributor"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "6c2d130e-ba66-408a-bdf9-f426a9730923"
      + id               = (known after apply)
      + member_object_id = "96b4a135-4a67-45db-a565-988d7cf7eda6"
    }

  # module.environment["sbox"].azuread_group_member.members["DTS Operations"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
      + id               = (known after apply)
      + member_object_id = "96b4a135-4a67-45db-a565-988d7cf7eda6"
    }

  # module.environment["sbox"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "dc2f4ae1-25f7-4c18-94f1-9c87f16eaf29"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "b201f38b-4f31-4301-8426-9e5ccc6c383d"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.environment["sbox"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-sbox-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
    }

  # module.environment["sbox"].azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "enterprise-sbox-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "enterprise-sbox-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }
      + worker_count                 = (known after apply)
    }

  # module.environment["sbox"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["sbox"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["stg"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "0765b073-cc02-4287-ba01-4a8dff3e1a93"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "cfd4c329-8f97-53b1-9dcb-0fcb4593ffcf"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Operations (env:stg) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Operations (env:stg)" -> null
              - enabled                    = true -> null
              - id                         = "cfd4c329-8f97-53b1-9dcb-0fcb4593ffcf" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Operations (env:stg) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Operations (env:stg)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:stg) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:stg)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:stg) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:stg)"
              + value                      = "user_impersonation"
            }
        }

      ~ web {
          ~ homepage_url  = "https://dev.azure.com/hmcts/Operations" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.environment["stg"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "0765b073-cc02-4287-ba01-4a8dff3e1a93"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["stg"].azuread_group.groups["DNS Zone Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "STG DNS Zone Contributer Group" -> "Grants dns zone contributor permissions to the stg environment"
        id                         = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["stg"].azuread_group.groups["DTS Operations"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "STG Operations elevated access" -> "stg Operations elevated access"
        id                         = "63469462-b784-42e8-8a66-20a8840ac84a"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["stg"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a"
    }

  # module.environment["stg"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + id               = (known after apply)
      + member_object_id = "63469462-b784-42e8-8a66-20a8840ac84a"
    }

  # module.environment["stg"].azuread_group_member.members["DNS Zone Contributor"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + id               = (known after apply)
      + member_object_id = "9bf470fb-2fcd-46b8-9eb1-2b2bea4bec78"
    }

  # module.environment["stg"].azuread_group_member.members["DTS Operations"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "63469462-b784-42e8-8a66-20a8840ac84a"
      + id               = (known after apply)
      + member_object_id = "9bf470fb-2fcd-46b8-9eb1-2b2bea4bec78"
    }

  # module.environment["stg"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "9796bbdf-e1ef-4054-941c-c2b553c42f0f"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "5dc19618-2431-4cf2-8964-d215cce2175f"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.environment["stg"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-stg-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.environment["stg"].azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "enterprise-stg-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "enterprise-stg-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + worker_count                 = (known after apply)
    }

  # module.environment["stg"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["stg"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.environment["test"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "90950051-fbb1-40e5-aede-b661a736c1ef"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "6ede0ccc-5f87-b27b-30fe-3ff515c7f215"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Operations (env:test) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Operations (env:test)" -> null
              - enabled                    = true -> null
              - id                         = "6ede0ccc-5f87-b27b-30fe-3ff515c7f215" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Operations (env:test) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Operations (env:test)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Operations (env:test) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Operations (env:test)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Operations (env:test) on your behalf."
              + user_consent_display_name  = "Access DTS Operations (env:test)"
              + value                      = "user_impersonation"
            }
        }

      ~ web {
          ~ homepage_url  = "https://dev.azure.com/hmcts/Operations" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.environment["test"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "90950051-fbb1-40e5-aede-b661a736c1ef"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.environment["test"].azuread_group.groups["DNS Zone Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "TEST DNS Zone Contributer Group" -> "Grants dns zone contributor permissions to the test environment"
        id                         = "f0ab83b0-38df-4ae5-b203-fcef7ac01488"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["test"].azuread_group.groups["DTS Operations"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "TEST Operations elevated access" -> "test Operations elevated access"
        id                         = "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.environment["test"].azuread_group_member.acr will be created
  + resource "azuread_group_member" "acr" {
      + group_object_id  = "d067416c-5ac7-4289-aa38-c1c9bb5800aa"
      + id               = (known after apply)
      + member_object_id = "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f"
    }

  # module.environment["test"].azuread_group_member.dns_zone_contributor will be created
  + resource "azuread_group_member" "dns_zone_contributor" {
      + group_object_id  = "f0ab83b0-38df-4ae5-b203-fcef7ac01488"
      + id               = (known after apply)
      + member_object_id = "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f"
    }

  # module.environment["test"].azuread_group_member.members["DNS Zone Contributor"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "f0ab83b0-38df-4ae5-b203-fcef7ac01488"
      + id               = (known after apply)
      + member_object_id = "1c86ae42-3d30-4159-8e13-f7b20bec2d43"
    }

  # module.environment["test"].azuread_group_member.members["DTS Operations"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "6bb3f8b2-b125-45d4-b0c2-60fef02a7d7f"
      + id               = (known after apply)
      + member_object_id = "1c86ae42-3d30-4159-8e13-f7b20bec2d43"
    }

  # module.environment["test"].azuredevops_serviceendpoint_azurerm.endpoint[0] will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "4df325b3-2881-4a16-933d-0c9dc1961158"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "abdc13f5-771c-426e-873d-8af904478062"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.environment["test"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "enterprise-test-rg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
    }

  # module.environment["test"].azurerm_service_plan.asp will be created
  + resource "azurerm_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "enterprise-test-asp"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "enterprise-test-rg"
      + sku_name                     = "Y1"
      + tags                         = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-enterprise"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Medium"
          + "environment"  = "testing"
        }
      + worker_count                 = (known after apply)
    }

  # module.environment["test"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.environment["test"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 81 to add, 36 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":29,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->